Capitulo9/calculadora/soap-examples/somar.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:cal="http://calculadora.com/">
  <soapenv:Header/>
  <soapenv:Body>
    <cal:somar>
      <a>3</a>
      <b>5</b>
    </cal:somar>
  </soapenv:Body>
</soapenv:Envelope>
